examples/gks_flux_validation/sodShockTube/Allrun
#!/usr/bin/env bash
case_dir="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
source "$(git -C "$(dirname "${BASH_SOURCE[0]}")" rev-parse --show-toplevel)/scripts/openfoam10-env.sh"
set -euo pipefail
cd "${case_dir}"

./Allclean
./prepare_case
/usr/bin/time -f 'elapsed_seconds=%e' -o runtime.solver \
    GpuGkp > log.solver 2>&1
PYTHONDONTWRITEBYTECODE=1 python3 check_sod.py
PYTHONDONTWRITEBYTECODE=1 python3 postprocess.py
